request.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:mtrep="http://miktex.org/2006/06/repository" xmlns:mtrep2="http://miktex.org/2007/03/repository" xmlns:mtrep3="http://miktex.org/2007/07/repository" xmlns:mtrep4="http://miktex.org/2007/10/repository" xmlns:mtrep5="http://miktex.org/2008/05/repository" xmlns:mtrep6="http://miktex.org/2015/06/repository" xmlns:mtrep7="http://miktex.org/2015/08/repository"><SOAP-ENV:Body><mtrep6:GetRepositories4><mtrep6:clientInfo><mtrep6:Name>explorer/mpm_mfc_admin/MPM</mtrep6:Name><mtrep6:Version>2.9.5822</mtrep6:Version></mtrep6:clientInfo><mtrep6:onlyOnline>true</mtrep6:onlyOnline><mtrep6:noCorrupted>true</mtrep6:noCorrupted><mtrep6:httpOnly>false</mtrep6:httpOnly><mtrep6:excludeHidden>true</mtrep6:excludeHidden><mtrep6:maxDelay>-1</mtrep6:maxDelay><mtrep6:releaseState>Stable</mtrep6:releaseState></mtrep6:GetRepositories4></SOAP-ENV:Body></SOAP-ENV:Envelope>
